Repository: Wayrion/Damascus-Cogs
Catalog: aitickets/commands/locales/*.po
Languages: ru_ru

source: Base support ticket settings
ru_ru: Базовая настройка тикетов

source: Ticket Setup Guide
ru_ru: Руководство по настройке тикетов

source: To create a support ticket panel, type
ru_ru: Для создания тикет-панели, введите:

source: Set the category ID that new tickets will be created under if using channel tickets.
ru_ru: Введите ID категории, в которой будут создаваться тикеты, если используются каналы, вместо веток.

source: Step 1
ru_ru: Шаг 1:

source: Set the channel that the bots ticket panel will be located in.
ru_ru: Установите канал, в котором будет располагаться тикет-панель бота.

source: Step 2
ru_ru: Шаг 2:

source: Set the ID of the bots ticket panel message.
ru_ru: Установите ID сообщения тикет-панели бота.

source: At this point the ticket panel will be activated, all following steps are for extra customization. If you need a message to add the buttons to, you can use the `{}tickets embed` command.
ru_ru: С этого момента, тикет-панель будет активирована, а все последующие действия направлены на дополнительную кастомизацию. Если Вам нужно сообщение для добавления кнопок, Вы можете использовать команду `{}tickets embed`.

source: If the bot is having trouble finding the message, run the command in the same channel as it.
ru_ru: Если приложение не может найти сообщение, выполните команду в том же канале, где и сообщение.

source: Step 3
ru_ru: Шаг 3:

source: Set the text of the ticket panel button.
ru_ru: Установите текст для кнопки тикет-панели.

source: Button Text
ru_ru: Текст кнопки

source: Set the ticket panel button color.
ru_ru: Установите цвет кнопки для тикет-панели.

source: Valid colors are
ru_ru: Действительные цвета:

source: Button Color
ru_ru: Цвет кнопки

source: Set the button emoji for the ticket panel.
ru_ru: Установите эмодзи кнопки для тикет-панели.

source: Button Emoji
ru_ru: Эмодзи кнопки

source: Use threads instead of channels for tickets
ru_ru: Использовать ветки заместо каналов для тикетов

source: Thread Tickets
ru_ru: Тикеты в ветках

source: Add a message the bot sends to the user in their ticket.
ru_ru: Добавьте сообщение, которое приложение отправляет пользователю в его заявку.

source: Ticket Messages
ru_ru: Сообщения тикетов

source: View and remove a messages the bot sends to the user in their ticket.
ru_ru: Просматривайте и удаляйте сообщения, которые бот отправляет пользователю в его тикете.

source: Remove/View Ticket Messages
ru_ru: Удалить/просмотреть сообщения тикетов

source: Set the naming format for ticket channels that are opened.
ru_ru: Установить именной формат для тикет-каналов, когда те открываются.

source: Ticket Channel Name
ru_ru: Название тикет-каналов

source: Set log channel for a ticket panel.
ru_ru: Установите канал логирования для тикет-панели.

source: Log Channel
ru_ru: Лог-канал

source: Tip: you can create multiple support panels using the same message for a multi-button panel
ru_ru: Подсказка: Вы можете создать несколько панелей, используя одно сообщение для многокнопочной тикет-панели.

source: Add a support ticket panel
ru_ru: Добавить тикет-панель

source: Panel Saved
ru_ru: Панель сохранена

source: Your panel has been added and will need to be configured.
ru_ru: Ваша панель была добавлена и ожидает конфигурации.

source: Panel already exists!
ru_ru: Панель уже существует.

source: Set the category ID for a ticket panel
ru_ru: Установите ID категории для тикет-панели.

source: I need the `manage channels` permission to set this category
ru_ru: Мне нужно право `управлять каналами` для корректной конфигурации данной категории.

source: I need `manage permissions` enabled in this category
ru_ru: Мне нужно право `управлять правами` в этой категории.

source: I need the `attach files` permission to set this category
ru_ru: Мне нужно право `прикреплять файлы` для корректной конфигурации данной категории.

source: I cannot see that category!
ru_ru: Я не вижу данную категорию.

source: I cannot see message history in that category!
ru_ru: Я не вижу историю сообщений в этой категории

source: Panel does not exist!
ru_ru: Панель не существует

source: New tickets will now be opened under that category!
ru_ru: Новые тикеты будут открываться в указанной категории

source: Set the channel ID where a ticket panel is located
ru_ru: Установить ID канала, где будет расположена панель тикетов

source: I cannot see that channel!
ru_ru: Я не вижу данный канал

source: I cannot see message history in that channel!
ru_ru: Я не вижу историю сообщений в этой категории

source: Set the message ID of a ticket panel Run this command in the same channel as the ticket panel message
ru_ru: Установить ID сообщения для панели тикетов Выполните данную команду в том же канале, где и панель тикетов

source: Category ID must be set for this panel first!
ru_ru: Сперва должен быть установлен ID категории для этой панели

source: Set the button text for a support ticket panel
ru_ru: Установите текст кнопки для панели тикетов

source: The text content of a button must be less than 80 characters!
ru_ru: Количество символов кнопки не должно превышать 80!

source: This is what your button will look like with this text!
ru_ru: Это пример, как будет выглядеть Ваша кнопка с заданным текстом

source: Set the button color for a support ticket panel
ru_ru: Установите цвет кнопки для панели тикетов

source: is not valid, must be one of the following
ru_ru: неверно, должно быть одно из предложенных

source: This is what your button will look like with this color!
ru_ru: Это пример, как будет выглядеть Ваша кнопка с заданным цветом

source: Set the button emoji for a support ticket panel
ru_ru: Установите эмодзи для кнопки в Вашей панели тикетов

source: This is what your button will look like with this emoji!
ru_ru: Это пример, как будет выглядеть Ваша кнопка с заданным эмодзи

source: Failed to create test button. Error:
ru_ru: Не удалось создать тестовую кнопку. Ошибка:

source: Toggle a panel on/off Disabled panels will still show the button but it will be disabled
ru_ru: Включить или выключить панель (on/off) Отключённые панели тикетов всё ещё будут отображать кнопки, однако, нерабочие

source: Panel **Enabled**
ru_ru: Панель **включена**

source: Panel **Disabled**
ru_ru: Панель **отключена**

source: Set the default ticket channel name for a panel You can include the following in the name `{num}` - Ticket number `{user}` - user's name `{displayname}` - user's display name `{id}` - user's ID `{shortdate}` - mm-dd `{longdate}` - mm-dd-yyyy `{time}` - hh-mm AM/PM according to bot host system time You can set this to {default} to use default "Ticket-Username
ru_ru: Set the default ticket channel name for a panel Установить стандартное название тикет-канала в панели Вы можете использовать следующие аргументы в названии: `{num}` - Номер тикета `{user}` - Имя пользователя `{displayname}` - Отображаемое имя пользователя `{id}` - ID пользователя `{shortdate}` - мм-дд `{longdate}` - мм-дд-гггг `{time}` - чч-мм AM/PM, в зависимости от времени хоста Вы можете сбросить настройки до стандартных {default} для использования стаднартных "Ticket-Username"

source: Toggle whether a certain panel uses threads or channels
ru_ru: Переключает, использует ли определенная панель ветки или каналы

source: Set a panel channel first!
ru_ru: Сперва установите канал для панели!

source: I am missing the `Create Private Threads` permission!
ru_ru: У меня нет права `Создания приватных веток`

source: I am missing the `Send Messages in Threads` permission!
ru_ru: У меня нет права `Отправлять сообщения в ветках`

source: The {} panel will no longer use threads
ru_ru: Панель {} более не использует ветки

source: The {} panel will now use threads
ru_ru: Панель {} теперь использует ветки

source: Throw a modal when the close button is clicked to enter a reason
ru_ru: При нажатии кнопки закрытия выдается модальное значение для ввода причины

source: The {} panel will no longer show a close reason modal
ru_ru: Панель {} более не отображает причину закрытия

source: The {} panel will now show a close reason modal
ru_ru: Панель {} будет отображать причину закрытия

source: Set the logging channel for each panel's tickets
ru_ru: Установите канал логирования для каждой тикет-панели

source: I cannot send messages in that channel!
ru_ru: Я не могу отправлять сообщения в данный канал

source: I cannot embed links in that channel!
ru_ru: Я не могу создавать эмбед-ссылки в данном канале

source: I cannot attach files in that channel!
ru_ru: Я не могу прикреплять файлы в данном канале

source: Set a title for a ticket panel's modal
ru_ru: Установите заголовок для модала тикет-панели

source: The max length is 45!
ru_ru: Максимальная длина — 45

source: Modal title set!
ru_ru: Оглавление модала установлено

source: Modal title removed!
ru_ru: Оглавление модала удалено

source: Add a modal field a ticket panel Ticket panels can have up to 5 fields per modal for the user to fill out before opening a ticket. If modal fields are added and have required fields, the user will have to fill them out before they can open a ticket. There is no toggle for modals, if a panel has them it will use them, if they don't then it just opens the ticket When the ticket is opened, it sends the modal field responses in an embed below the ticket message **Note** `field_name` is just the name of the field stored in config, it won't be shown in the modal and should not have spaces in it Specify an existing field name to delete a modal field (non-case-sensitive)
ru_ru: Добавьте модальное поле в тикет-панель Панели управления билетами могут содержать до 5 полей для каждой модели, которые пользователь должен заполнить перед открытием тикета. Если добавлены модальные поля и они содержат обязательные поля, пользователь должен будет заполнить их, прежде чем сможет открыть билет. Для моделей нет переключателя, если они есть на панели, она будет их использовать, если их нет, то она просто откроет тикет Когда тикет открыт, он отправляет ответы в модальном поле во вложении под сообщением о тикете **Примечание:** `field_name` это просто имя поля, хранящегося в конфигурации, он не будет показан в модели и не должен содержать пробелов Укажите существующее название поля, чтобы удалить модальное поле. **[!] без** учета регистра

source: Field for {} panel has been removed!
ru_ru: Поле для {} панели было удалено

source: The most fields a modal can have is 5!
ru_ru: Модал может иметь лишь 5 полей

source: Modal field addition cancelled
ru_ru: Отменено добавление модального поля

source: type 'cancel' to cancel at any time
ru_ru: Введите `cancel`, чтобы отменить действие в любое время

source: What would you like the field label to be? (45 chars or less)
ru_ru: Какой бы вы хотели видеть метку поля? (не более 45 символов)

source: Modal field labels must be 45 characters or less!
ru_ru: Метки модальных полей должны быть не более 45 символов

source: What style would you like the text box to be? (long/short)
ru_ru: Какой стиль текстового поля Вы предпочитаете? (long/short)

source: Style must be long or short!
ru_ru: Стиль должен быть длинным или коротким!

source: Would you like to set a placeholder for the text field? This is text that shows up in the box before the user types.
ru_ru: Вы хотите установить плейсхолдер для текстового поля? Это текст, который отображается в поле перед тем, как пользователь начнёт писать.

source: Type your desired placeholder below (100 chars max)
ru_ru: Введите желаемый плейсхолдер ниже (максимум — 100 символов)

source: Placeholders must be 100 characters or less!
ru_ru: Плейсхолдер должен содержать не более 100 символов.

source: Would you like to set a default value for the text field?
ru_ru: Вы хотите установить значение по умолчанию для текстового поля?

source: Type your desired default value below
ru_ru: Введите желаемое значение по умолчанию ниже

source: Would you like to make this field required?
ru_ru: Вы хотите сделать это поле обязательным?

source: Would you like to set a minimum length for this field?
ru_ru: Вы хотите установить минимальную длину для этого поля?

source: Type the minimum length for this field below (less than 4000)
ru_ru: Введите минимальную длину для этого поля ниже (не более 4000 символов)

source: That is not a number!
ru_ru: Указанное значение не является числом.

source: Would you like to set a maximum length for this field?
ru_ru: Вы хотите установить максимальную длину для этого поля?

source: Type the maximum length for this field below (up to 4000)
ru_ru: Введите максимальную длину для этого поля ниже (не более 4000 символов)

source: Your modal field has been added!
ru_ru: Ваше модальное поле добавлено.

source: Your modal field has been edited!
ru_ru: Ваше модальное поле было отредактировано.

source: View/Delete a ticket message for a support ticket panel
ru_ru: Просмотр/удаление тикет-сообщения для тикет-панели

source: This panel does not have any modal fields set!
ru_ru: У этой панели нет установленных модальных полей.

source: Page
ru_ru: Страница

source: Modal Fields for {}
ru_ru: Модальные поля для {}

source: Editing {} modal field for {}!
ru_ru: Редактирование {} модального поля для {}.

source: Modal field has been deleted from
ru_ru: Модальное поле было удалено из

source: Add a message embed to be sent when a ticket is opened You can include any of these in the embed to be replaced by their value when the message is sent `{username}` - Person's Discord username `{mention}` - This will mention the user `{id}` - This is the ID of the user that created the ticket The bot will walk you through a few steps to set up the embed
ru_ru: Добавьте сообщение-эмбед которое отправится в открытые тикеты. Вы можете вставить значения ниже для того, чтобы они заменились на действительные данные в эмбед-сообщении. `{username}` - Псевдоним пользователя `{mention}` - Упоминание пользователя `{id}` - ID создателя тикета Бот также даст Вам несколько последующих советов для настройки эмбеда

source: type 'cancel' to cancel the setup
ru_ru: Введите `cancel` для того, чтобы отменить установку.

source: Would you like this ticket embed to have a title?
ru_ru: Хотите ли Вы, чтобы этот эмбед тикета имел оглавление?

source: Type your desired title below
ru_ru: Введите желаемое оглавление ниже

source: Ticket message addition cancelled
ru_ru: Добавление тикет-сообщения отменено

source: Type your desired ticket message below
ru_ru: Введите желаемое тикет-сообщение ниже

source: Would you like this ticket embed to have a footer?
ru_ru: Хотите ли Вы, чтобы этот эмбед тикета имел нижний колонтитул (footer)?

source: Type your footer
ru_ru: Введите свой нижний колонтитул

source: cancel
ru_ru: отмена

source: Your ticket message has been added!
ru_ru: Ваше тикет-сообщение было добавлено.

source: There are no panels available! Use
ru_ru: Нет доступных панелей. Используйте

source: to create one.
ru_ru: чтобы создать один.

source: Valid panels are:
ru_ru: Допустимые панели:

source: This panel does not have any messages added!
ru_ru: Эта панель не имеет никаких добавленных сообщений.

source: **Title**
ru_ru: **Оглавление**

source: **Description**
ru_ru: **Описание**

source: **Footer**
ru_ru: **Нижний колонтитул**

source: Ticket Messages for:
ru_ru: Тикет-сообщение для:

source: Ticket message has been deleted from
ru_ru: Сообщение тикета было удалено из

source: View/Delete currently configured support ticket panels
ru_ru: Просмотреть/удалить настроенных тикет-панелей

source: `Disabled: `
ru_ru: `Выключено: `

source: `Category: `
ru_ru: `Категория: `

source: `Channel: `
ru_ru: `Канал: `

source: `MessageID: `
ru_ru: `ID Сообщения: `

source: `ButtonText: `
ru_ru: `Текст кнопки: `

source: `ButtonColor: `
ru_ru: `Цвет кнопки: `

source: `ButtonEmoji: `
ru_ru: `Эмодзи кнопки: `

source: `TicketNum: `
ru_ru: `Номер тикета: `

source: `Use Threads: `
ru_ru: `Использовать ветки: `

source: `TicketMessages: `
ru_ru: `Сообщение тикета: `

source: `TicketName: `
ru_ru: `Название тикета: `

source: `Modal Fields: `
ru_ru: `Модальные поля: `

source: `Modal Title: `
ru_ru: `Заголовок модала: `

source: `LogChannel: `
ru_ru: `Лог-канал: `

source: `Priority: `
ru_ru: `Приоритет: `

source: `Button Row: `
ru_ru: `Строка кнопки: `

source: `Reason Modal: `
ru_ru: `Модальная причина: `

source: `Max Claims: `
ru_ru: `Макс. взятия: `

source: Panel Roles(Mention)
ru_ru: Роли панели(Mention)

source: Required Roles to Open
ru_ru: Необходимые роли для открытия

source: Page
ru_ru: Страница

source: panel has been deleted!
ru_ru: панель была удалена!

source: There are no more panels configured!
ru_ru: Больше нет настроенных панелей!

source: View support ticket settings
ru_ru: Просмотреть настройки тикетов

source: hours
ru_ru: часы

source: hour
ru_ru: час

source: Disabled
ru_ru: Отключено

source: Detailed
ru_ru: Подробно

source: Simple
ru_ru: Простой

source: `Max Tickets: `
ru_ru: `Макс. тикетов: `

source: `DM Alerts: `
ru_ru: `Уведомления в ЛС: `

source: `Users can Rename: `
ru_ru: `Могут переименовать: `

source: `Users can Close: `
ru_ru: `Могут закрывать: `

source: `Users can Manage: `
ru_ru: `Могут управлять: `

source: `Save Transcripts: `
ru_ru: `Сохранять сообщения: `

source: `Auto Close: `
ru_ru: `Автозакрытие: `

source: On
ru_ru: Включено

source: Off
ru_ru: Отключено

source: `NoResponseDelete: `
ru_ru: `УдалятьБезОтвета: `

source: Invalid
ru_ru: Некорректно

source: Tickets Core Settings
ru_ru: Настройка ядра тикетов

source: Support Roles(Mention)
ru_ru: Роль помощника(Mention)

source: Blacklist
ru_ru: Черный список

source: Thread tickets will be closed/archived rather than deleted
ru_ru: Тикеты в ветках будут закрыты и архивированы, но не удалены

source: Thread tickets will be deleted instead of closed/archived
ru_ru: Тикеты в ветках будут удалены, вместо закрытия и архивации

source: Thread Ticket Auto-Add
ru_ru: Автодобавление тикетов-веток

source: Auto-add support and panel roles to tickets that use threads: **{}**
ru_ru: Автодобавление ролей панели и помощников для тикетов, использующих ветки: **{}**

source: Set the max tickets a user can have open at one time of any kind
ru_ru: Установите максимальное количество тикетов, которые участник может держать открытыми

source: Max ticket amount must be greater than 0!
ru_ru: Максимальное количество тикетов должно быть больше нуля!

source: Add/Remove ticket support roles (one at a time) **Optional**: include `true` for mention to have that role mentioned when a ticket is opened To remove a role, simply run this command with it again to remove it
ru_ru: Добавить/убрать роль Администратора тикетов (не более одной) **Опционально**: пропишите `true` для упоминания роли во время открытия тикета Чтобы убрать роль, просто пропишите команду заново

source: {} has been removed from support roles
ru_ru: роль {} была удалена из Администрирующих ролей

source: has been added to support roles
ru_ru: была добавлена в Администрирующие роли

source: Add/Remove roles for a specific panel To remove a role, simply run this command with it again to remove it **Optional**: include `true` for mention to have that role mentioned when a ticket is opened These roles are a specialized subset of the main support roles. Use this role type if you want to isolate specific groups to a certain panel.
ru_ru: Добавить/убрать роль для отдельной панели Чтобы убрать роль, просто пропишите команду заново **Опционально**: пропишите `true` для упоминания роли во время открытия тикета Эти роли являются специализированным подмножеством основных ролей поддержки. Используйте этот тип настройки, если Вы хотите распределить различные роли для конкретных целей.

source: {} has been removed from the {} panel roles
ru_ru: роль {} была удалена из ролей панели {}

source: has been added to the {} panel roles
ru_ru: роль была добавлена в панель {}

source: Set how many staff members can claim/join a ticket before the join button is disabled (If using threads)
ru_ru: Укажите, сколько сотрудников могут принять/присоединиться к тикету до того, как кнопка присоединиться будет отключена (при использовании веток)

source: Amount cannot be negative!
ru_ru: Значение не может быть негативным!

source: Up to {} staff member(s) can claim a single ticket
ru_ru: Вплоть до {} сотрудников Администрации могут взять конкретный тикет

source: Add/Remove roles required to open a ticket for a specific panel Specify the same role to remove it
ru_ru: Добавить/убрать роли, требуемые для открытия тикета конкретной панели Чтобы убрать роль, просто пропишите команду заново

source: {} has been removed from the {} panel's required open roles
ru_ru: роль {} была удалена из требуемых для открытия тикетов панели {}

source: has been added to the {} panel's required open roles
ru_ru: добавлена в требуемые открытия роли панели {}

source: Set an alternate channel that tickets will be opened under for a panel If the panel uses threads, this needs to be a normal text channel. If the panel uses channels, this needs to be a category. If the panel is a channel type and a channel is used, the bot will use the category associated with the channel. To remove the alt channel, specify the existing one
ru_ru: Установите альтернативный канал, который заявки будут открыты для панели Если панель использует ветки, это должен быть обычный текстовый канал. Если панель использует каналы, то она должна быть категорией. Если панель является типом канала и используется канал бот будет использовать категорию, связанную с каналом. Для удаления alt канала, укажите существующую

source: Alt channel has been removed for this panel!
ru_ru: Альтернативный канал был удален для этой панели!

source: Alt channel has been set to {}!
ru_ru: Альтернативный канал был установлен на {}!

source: Set the priority order of a panel's button
ru_ru: Установить порядок приоритета кнопок панели

source: Priority needs to be between 1 and 25
ru_ru: Приоритет должен быть от 1 до 25

source: Priority for this panel has been set to {}!
ru_ru: Приоритет для этой панели установлен на {}!

source: Set the row of a panel's button (0 - 4)
ru_ru: Задать строку кнопки панели (0 - 4)

source: Row needs to be between 0 and 4
ru_ru: Строка должна быть между 0 и 4

source: This panel message already has the max amount of buttons for that specific row
ru_ru: Это сообщение в панели уже имеет максимальное количество кнопок для этой строки

source: The row number for this panel has been set to {}!
ru_ru: Номер строки для этой панели был установлен в {}!

source: Add/Remove users or roles from the blacklist Users and roles in the blacklist will not be able to create a ticket
ru_ru: Добавить/убрать участников или роли из чёрного списка Участники и роли, находящиеся в чёрном списке, не могут открывать тикеты

source: has been removed from the blacklist
ru_ru: был удалён из чёрного списка

source: has been added to the blacklist
ru_ru: добавлен в черный список

source: Auto-close ticket if opener doesn't say anything after X hours of opening Set to 0 to disable this If using thread tickets, this translates to the thread's "Hide after inactivity" setting. Your options are: - 1 hour - 24 hours (1 day) - 72 hours (3 days) - 168 hours (1 week) Tickets will default to the closest value you select.
ru_ru: Автоматически закрыть тикет, если создавший его ничего не напишет в течение X часов с открытия Установите значение 0, чтобы отключить это При использовании тикетов в ветках, это также интерпритируется как настройка "Скрыть после неактивности". Доступные варианты: - 1 час - 24 часа (1 день) - 72 часа (3 дня) - 168 часов (1 неделя) Значение будет автоматически подставлено к ближайшему выбранному.
