Repository: Wayrion/Damascus-Cogs
Catalog: aitickets/commands/locales/*.po
Languages: ru_ru

source: Set a channel for the live overview message The overview message shows all active tickets across all configured panels for a server.
ru_ru: Установите канал для живого обзора сообщения В обзорном сообщении отображаются все активные заявки на всех настроенных панелях для сервера.

source: Overview channel has been **Disabled**
ru_ru: Канал обзора был **отключен**

source: Overview channel has been set to {}
ru_ru: {} был установлен как канал обзора

source: Toggle whether channels are mentioned in the active ticket overview
ru_ru: Выберите, упоминаются ли каналы в активном обзоре заявок

source: Ticket channels will no longer be mentioned in the active ticket channel
ru_ru: Каналы заявки больше не будут упоминаться в активном канале заявки

source: Ticket channels now be mentioned in the active ticket channel
ru_ru: Каналы заявок теперь упоминаются в активном канале заявок

source: Cleanup tickets that no longer exist
ru_ru: Очистка тикетов, которые больше не существуют

source: (Toggle) The bot sending DM's for ticket alerts
ru_ru: (Переключить) Будет ли бот отсылать сообщения в ЛС касательно статуса тикетов

source: DM alerts have been **Disabled**
ru_ru: Оповещения в ЛС были **отключены**

source: DM alerts have been **Enabled**
ru_ru: Оповещения в ЛС были **включены**

source: (Toggle) Thread tickets being closed & archived instead of deleted
ru_ru: (Переключить) Будут ли тикеты в ветках закрываться и архивироваться, вместо их удаления

source: Closed ticket threads will be **Deleted**
ru_ru: Закрытые тикет-ветки будут **удаляться**

source: Closed ticket threads will be **Closed & Archived**
ru_ru: Закрытые тикет-ветки будут **закрываться и архивироваться**

source: (Toggle) If users can rename their own tickets
ru_ru: (Переключить) Может ли участник переименовывать собственные тикеты

source: User can no longer rename their support channel
ru_ru: Пользователь больше не может переименовать свои тикеты

source: User can now rename their support channel
ru_ru: Теперь пользователь может переименовать свои тикеты

source: (Toggle) If users can close their own tickets
ru_ru: (Переключить) Может ли участник закрывать собственные тикеты

source: User can no longer close their support ticket channel
ru_ru: Пользователь больше не может закрывать свои тикеты

source: User can now close their support ticket channel
ru_ru: Теперь пользователь может закрывать свои тикеты

source: (Toggle) If users can manage their own tickets Users will be able to add/remove others to their support ticket
ru_ru: (Переключить) Могут ли пользователи самостоятельно управлять собственными тикетами Пользователи смогут добавлять/удалять других в их тикет

source: User can no longer manage their support ticket channel
ru_ru: Пользователь больше не может управлять своими тикетами

source: User can now manage their support ticket channel
ru_ru: Теперь пользователь может управлять своими тикетами

source: (Toggle) Auto-add support and panel roles to thread tickets Adding a user to a thread pings them, so this is off by default
ru_ru: (Переключить) Автоматически добавлять роль-Администратора и роли панелей в ветки Добавление пользователя в ветки уведомит их, так что по умолчанию это выключено

source: Support and panel roles will no longer be auto-added to thread tickets
ru_ru: Администрирующая роль и роль панели более не будут автоматически добавляться в тикет-ветки

source: Support and panel roles will be auto-added to thread tickets
ru_ru: Администрирующая роль и роль панели будут автоматически добавляться в тикет-ветки

source: (Toggle) Ticket transcripts Closed tickets will have their transcripts uploaded to the log channel
ru_ru: (Переключить) Включить логгирование сообщений Закрытые тикеты будут сохранять диалог в формате текстового документа, в дальнейшем отсылая это в лог-канал

source: Transcripts of closed tickets will no longer be saved
ru_ru: Логи закрытых тикетв более не будут сохраняться

source: Transcripts of closed tickets will now be saved
ru_ru: Логи закрытых тикетв будут сохраняться

source: (Toggle) Interactive transcripts Transcripts will be an interactive html file to visualize the conversation from your browser.
ru_ru: (Переключить) Интерактивное логгирования сообщений Сохранённая дискуссия будет сохранена в формате html, чтобы визуализировать диалог в Вашем браузере.

source: Transcripts of closed tickets will no longer be interactive
ru_ru: Логи закрытых тикетв не будут интерактивными

source: Transcripts of closed tickets will now be interactive
ru_ru: Логи закрытых тикетв будут интерактивными

source: Update a message with another message (Target gets updated using the source)
ru_ru: Обновить сообщение с другого сообщения (целевое сообщение будет обновлено с учётом исходника)

source: Failed to update message!
ru_ru: Не удалось обновить сообщение!

source: Create an embed for ticket panel buttons to be added to
ru_ru: Создать эмбед для кнопок тикет-панели, которые будут добавлены в

source: type 'cancel' to cancel
ru_ru: введите 'cancel' для отмены

source: Would you like this embed to have a footer?
ru_ru: Хотите ли Вы, чтобы этот эмбед имел нижний колонтитул (footer)?

source: Enter the desired footer
ru_ru: Введите желаемый нижний колонтитул

source: Embed creation cancelled
ru_ru: Создание эмбеда отменено

source: Would you like this embed to have a thumbnail?
ru_ru: Хотите ли Вы, чтобы этот эмбед имел обложку (thumbnail)?

source: Enter a url for the thumbnail
ru_ru: Введите url для обложки

source: Would you like this embed to have an image?
ru_ru: Хотите, чтобы этот эмбед имел изображение?

source: Enter a url for the image
ru_ru: Введите url изображения

source: Would you like to add a field to this embed?
ru_ru: Вы хотите добавить поле в этот эмбед?

source: Would you like to add another field to this embed? *There are currently {} fields*
ru_ru: Вы хотите добавить другое поле в это вложение? *Сейчас {} полей*

source: Enter the name of the field
ru_ru: Введите название поля

source: Enter the value of the field
ru_ru: Введите значение поля

source: Do you want this field to be inline?
ru_ru: Вы хотите, чтобы это поле было линейным?

source: Your embed has been sent!
ru_ru: Ваш эмбед был отправлен!

source: Failed to send embed! Exception: {}
ru_ru: Не удалось отправить эмбед! Исключение: {}

source: Add a user to your ticket
ru_ru: Добавить пользователя в Ваш тикет

source: This is not a ticket channel, or it has been removed from config
ru_ru: Это не тикет-канал, либо он был удален из конфигурации

source: You do not have permissions to add users to this ticket
ru_ru: У вас нет прав, чтобы добавлять пользователей в этот тикет

source: Failed to add user to ticket: {}
ru_ru: Не удалось добавить пользователя в тикет: {}

source: has been added to this ticket!
ru_ru: был добавлен в этот тикет!

source: Rename your ticket channel
ru_ru: Меняйте название тикета

source: You do not have permissions to rename this ticket
ru_ru: У вас недостаточно прав, чтобы переименовать этот тикет

source: I no longer have permission to edit this channel
ru_ru: У меня больше нет прав на редактирование этого канала

source: Renaming channel to {}
ru_ru: Переименование канала на {}

source: Close your ticket **Examples** `[p]close` - closes ticket with no reason attached `[p]close thanks for helping!` - closes with reason "thanks for helping!" `[p]close 1h` - closes in 1 hour with no reason attached `[p]close 1m thanks for helping!` - closes in 1 minute with reason "thanks for helping!"
ru_ru: Закройте Ваш тикет **Примеры**: `[p]close` - закрывает тикет без уточнения причины `[p]close благодарим за помощь!` - закрывает с причиной "благодарим за помощь!" `[p]close 1h` - закрывает тикет в течение одного часа без причины `[p]close 1m thanks for helping!` - закрывает в течение одной минуты с причиной "благодарим за помощь"

source: Cannot find the owner of this ticket! Maybe it is not a ticket channel or was cleaned from the config?
ru_ru: Не удается найти владельца этого тикета! Может быть, это не тикет, или он был удален из конфигурации?

source: You do not have permissions to close this ticket
ru_ru: У вас нет разрешения на закрытие этого тикета

source: This ticket will close {}
ru_ru: Этот тикет закроет {}

source: Closing cancelled!
ru_ru: Закрытие отменено!

source: Closing...
ru_ru: Закрываем...
